app/Controllers/BiblioController.php

    public function linkUsersWithBooks($bookid){
      $UsersModel = new BiblioModel();
      $BooksModel = new BiblioBooks();
      $RelationsModel = new BiblioRelations();
      $data = array(
        'id_user' => $UsersModel->getWhere(['email' => $_SESSION['username']])->getRowArray()['id'],
        'id_liv' => $bookid
      );
      $this->subtractBookFromStock($data['id_liv']);
      $RelationsModel->insert($data);
---
INSERT INTO `relations` (`id_user`, `id_liv`) VALUES ('32', '20')